### คำนวณค่าดัชนีมวลกาย BMI ###

weight = int(input("น้ำหนัก(กก.) = "))
while weight <= 30 or weight >= 150:
    print("ข้อมูลน้ำหนัก 'ไม่ถูกต้อง'")
    weight = int(input("น้ำหนัก(กก.) = "))

height = int(input("ส่วนสูง(ซม.) = "))/100
while height <= 60/100 or height >= 220/100:
    print("ข้อมูลส่วนสูง 'ไม่ถูกต้อง'")
    height = int(input("ส่วนสูง(ซม.) = "))/100

bmi = weight / (height**2)
print("ดัชนีมวลกาย(BMI) =", ('%.2f' % bmi))

if bmi <= 18.49:
    print("'ต่ำกว่าเกณฑ์ / ผอม'")
    print(">>>>> มีความเสี่ยงเกิดโรคขาดสารอาหาร")
elif bmi >= 18.50 and bmi <= 22.90:
    print("'ปกติ / สุขภาพดี'")
    print(">>>>> โอกาสการเกิดโรคแทรกซ้อนน้อยที่สุด")
elif bmi >= 23.00 and bmi <= 24.90:
    print("'ท้วม / โรคอ้วนระดับ 1'")
    print(">>>>> ภาวะน้ำหนักเกินระยะเริ่มต้น เริ่มมีโรคแทรกซ้อนเล็กน้อย")
elif bmi >= 25.00 and bmi <= 29.90:
    print("'อ้วน / โรคอ้วนระดับ 2'")
    print(">>>>> ภาวะน้ำหนักเกินมาก มีโรคแทรกซ้อนในระยะอ้วนเริ่มต้น")
else:
    print("'อ้วนมาก / โรคอ้วนระดับ 3'")
    print(">>>>> ภาวะน้ำหนักเกินมากที่สุด ก่อให้เกิดโรคแทรกซ้อนอย่างมาก")